Revit 2024 API
WaveDistributionType Enumeration
 The enumerated type representing the permitted values for the asset property "WaveDistribution" from the "Wave" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum WaveDistributionType
Visual Basic
Public Enumeration WaveDistributionType
Visual C++
public enum class WaveDistributionType
Members
Member name | Description
TwoD
ThreeD
See Also
Autodesk.Revit.DB.Visual Namespace